Varad-Prabhu/STM32F407VG_baremetal/19_RTC/Src/main.c
#include "stm32f407.h"
#include "gpio.h"
#include "systick.h"
#include "rtc.h"
#include "usart.h"

void SystemClock_Config(void)
{
    /* Configure Flash wait states */
    FLASH->ACR &= ~(0xFU << 0U);                    /* Clear latency bits */
    FLASH->ACR |= (5U << 0U);                       /* 5 wait states for 168 MHz */

    while ((FLASH->ACR & 0xFU) != 5U);              /* Wait for latency to be configured*/

    FLASH->ACR |= (1U << 8U);                       /* Enable prefetch */

    FLASH->ACR |= (1U << 9U);                       /* Enable instruction cache */

    FLASH->ACR |= (1U << 10U);                      /* Enable data cache */

    /* Disable PLL */
    RCC->CR &= ~(1U << 24U);

    /* Wait until PLL is fully disabled */
    while (RCC->CR & (1U << 25U));

    /* Configure PLL */
    RCC->PLLCFGR &= ~(0x3FU << 0U);                 /* Clear PLLM */
    RCC->PLLCFGR |= (16U << 0U);                    /* PLLM = 16, PLL Input = HSI / PLLM, PLL Input = 16 MHz / 16 = 1 MHz */
    RCC->PLLCFGR &= ~(0x1FFU << 6U);                /* Clear PLLN */
    RCC->PLLCFGR |= (336U << 6U);                   /* PLLN = 336, VCO Output = PLL Input * PLLN = 1 MHz * 336 = 336 MHz */
    RCC->PLLCFGR &= ~(0x3U << 16U);                 /* Clear PLLP */
    RCC->PLLCFGR |= (0U << 16U);                    /* PLLP = 2, SYSCLK = VCO Output / PLLP = 336 MHz / 2 = 168 MHz */
    RCC->PLLCFGR &= ~(0xFU << 24U);                 /* Clear PLLQ */
    RCC->PLLCFGR |= (7U << 24U);                    /* PLLQ = 7, USB OTG FS, SDIO and RNG Clock = VCO Output / PLLQ = 336 MHz / 7 = 48 MHz */  

    RCC->PLLCFGR &= ~(1U << 22U);                   /* Clear PLLSRC */
    RCC->PLLCFGR |= (0U << 22U);                    /* PLL source = HSI */

    /* Enable PLL */
    RCC->CR |= (1U << 24U);                         /* Main PLL enable */

    /* Wait until PLL is ready */
    while (!(RCC->CR & (1U << 25U)));               /* Wait until PLL is locked or ready */

    /* Configure AHB prescaler */
    RCC->CFGR &= ~(0xFU << 4U);                     /* Clear AHB prescaler bits */
    RCC->CFGR |= (0U << 4U);                        /* AHB prescaler = 1, HCLK = SYSCLK / 1 = 168 MHz */

    /* Configure APB1 prescaler */
    RCC->CFGR &= ~(0x7U << 10U);                    /* Clear APB1 prescaler bits */
    RCC->CFGR |= (5U << 10U);                       /* APB1 prescaler = 4, PCLK1 = HCLK / 4 = 42 MHz */

    /* Configure APB2 prescaler */
    RCC->CFGR &= ~(0x7U << 13U);                    /* Clear APB2 prescaler bits */
    RCC->CFGR |= (4U << 13U);                       /* APB2 prescaler = 2, PCLK2 = HCLK / 2 = 84 MHz */

    /* Select PLL as system clock */
    RCC->CFGR &= ~(0x3U << 0U);                     /* Clear SW bits */
    RCC->CFGR |= (2U << 0U);                        /* System clock switch = PLL */

    /* Wait until PLL becomes system clock */
    while (((RCC->CFGR >> 2U) & 0x03U) != 0x02U);   /* Wait until PLL is used as system clock */
}

int main(void)
{
    uint8_t previousSecond = 0xFF;
    RTC_TimeTypeDef time =
    {
        .hours = 10,
        .minutes = 35,
        .seconds = 0
    };

    RTC_DateTypeDef date =
    {
        .date = 19,
        .month = 7,
        .year = 26,
        .weekday = 7
    };
    static const char *WeekdayString[] =
    {
        "",
        "Monday",
        "Tuesday",
        "Wednesday",
        "Thursday",
        "Friday",
        "Saturday",
        "Sunday"
    };

    /* System clock configuration */
    SystemClock_Config();

    SysTick_Init(168000);
    SysTick_Start();

    GPIO_InitTypeDef GPIO_LED;
 
    GPIO_LED.Port = GPIOD;
    GPIO_LED.Pin = GPIO_PIN_12 | GPIO_PIN_13;
    GPIO_LED.Mode = GPIO_MODE_OUTPUT;
    GPIO_LED.Pull = GPIO_NOPULL;
    GPIO_LED.Speed = GPIO_SPEED_MEDIUM;
    GPIO_LED.OutputType = GPIO_OTYPE_PP;

    GPIO_Init(&GPIO_LED);

    /*----------------------------------------------------------*/
    /* Hardware Connections (USART2)                            */
    /*                                                          */
    /* STM32F407VG                USB-to-UART Module            */
    /* ---------------------------------------------------------*/
    /* PA2 (USART2_TX, AF7) ----> RXD                           */
    /* PA3 (USART2_RX, AF7) <---- TXD                           */
    /* GND ---------------------> GND                           */
    /*                                                          */
    /* USB-to-UART connected to PC                              */
    /* Baud Rate : 115200                                       */
    /*----------------------------------------------------------*/
    USART2_Init();

    RTC_Init();                                     /* Initialize RTC */

    RTC_SetTime(&time);
    RTC_SetDate(&date);
    RTC->ISR &= ~(1U << RTC_ISR_RSF_Pos);           /* Clear the registers synchronized flag */
    while (!(RTC->ISR & (1U << RTC_ISR_RSF_Pos)));  /* Wait until the RTC shadow registers are synchronized */

    while (1)
    {
        RTC_GetTime(&time);
        if (time.seconds != previousSecond)
        {
            previousSecond = time.seconds;

            RTC_GetDate(&date);

            USART2_WriteString("Time : ");

            USART2_Write2Digits(time.hours);
            USART2_WriteChar(':');

            USART2_Write2Digits(time.minutes);
            USART2_WriteChar(':');

            USART2_Write2Digits(time.seconds);

            USART2_WriteString("   Date : ");

            USART2_Write2Digits(date.date);
            USART2_WriteChar('/');

            USART2_Write2Digits(date.month);
            USART2_WriteChar('/');

            USART2_Write2Digits(date.year);

            USART2_WriteString("   Weekday : ");

            if ((date.weekday >= 1U) && (date.weekday <= 7U))
            {
                USART2_WriteString(WeekdayString[date.weekday]);
            }
            else
            {
                USART2_WriteString("Invalid");
            }

            USART2_WriteString("\r\n");
        }
    }

    return 0;
}
